Revit 2024 API
RebarBendingDetail.SetRotation Method
 Sets the rotation angle in radians for the bending detail relative to its view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static void SetRotation(
	Element bendingDetail,
	double rotation
)
Visual Basic
Public Shared Sub SetRotation ( _
	bendingDetail As Element, _
	rotation As Double _
)
Visual C++
public:
static void SetRotation(
	Element^ bendingDetail,
	double rotation
)
Parameters
bendingDetail
Type: Autodesk.Revit.DB.Element
 The bending detail for which we want to get the rotation.
rotation
Type: System.Double
 The new rotation angle of the bending detail relative to its view.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  -or- The given value for rotation is not a number -or- The given value for rotation is not finite
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RebarBendingDetail Class
Autodesk.Revit.DB.Structure Namespace